In [1]:
import pandas as pd
import numpy as np

In [8]:
df3 = pd.DataFrame({'id':[10],                             # Lets modify our row to a DataFrame
                    'name':['z'], 
                    'sub':['sub10']})

print(df3)

MyList1=[(1,10),(2,20),(3,30),(4,40),(5,50)]
labels1=['ID','NUM']
df1=pd.DataFrame(MyList1,columns=labels1)
print('\ndf1\n',df1)

   id name    sub
0  10    z  sub10

df1
    ID  NUM
0   1   10
1   2   20
2   3   30
3   4   40
4   5   50

#### appending

In [11]:
df3=df3.append(df1)
df3

    ID   NUM    id name    sub
0  NaN   NaN  10.0    z  sub10
0  1.0  10.0   NaN  NaN    NaN
1  2.0  20.0   NaN  NaN    NaN
2  3.0  30.0   NaN  NaN    NaN
3  4.0  40.0   NaN  NaN    NaN
4  5.0  50.0   NaN  NaN    NaN
0  1.0  10.0   NaN  NaN    NaN
1  2.0  20.0   NaN  NaN    NaN
2  3.0  30.0   NaN  NaN    NaN
3  4.0  40.0   NaN  NaN    NaN
4  5.0  50.0   NaN  NaN    NaN

In [13]:
df3.reset_index(inplace=True)
df3

    level_0  index   ID   NUM    id name    sub
0         0      0  NaN   NaN  10.0    z  sub10
1         1      0  1.0  10.0   NaN  NaN    NaN
2         2      1  2.0  20.0   NaN  NaN    NaN
3         3      2  3.0  30.0   NaN  NaN    NaN
4         4      3  4.0  40.0   NaN  NaN    NaN
5         5      4  5.0  50.0   NaN  NaN    NaN
6         6      0  1.0  10.0   NaN  NaN    NaN
7         7      1  2.0  20.0   NaN  NaN    NaN
8         8      2  3.0  30.0   NaN  NaN    NaN
9         9      3  4.0  40.0   NaN  NaN    NaN
10       10      4  5.0  50.0   NaN  NaN    NaN

### Conditionals in DataFrame
    This is used to perform comparisons on the records of DataFrame.
    The output of comparison is of boolean datatype.
    You can use this boolean to filter out records from the DataFrame.

In [15]:
market_df = pd.read_csv('http://pythonhow.com/supermarkets.csv')
market_df

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [18]:
market_df['Employees'] >  10

0    False
1     True
2     True
3    False
4     True
5     True
Name: Employees, dtype: bool

In [19]:
market_df[market_df['Employees']>10]

,ID,Address,City,State,Country,Name,Employees
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [22]:
market_df[~(market_df['Employees']>10)]

   ID       Address           City     State Country        Name  Employees
0   1  3666 21st St  San Francisco  CA 94114     USA     Madeira          8
3   4  3995 23rd St  San Francisco  CA 94114     USA  Ben's Shop         10

In [24]:
market_df[market_df['State']!= 'California']

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [26]:
market_df[(market_df['Employees'] >=15) & (market_df['State'] != 'CA 94119')]

,ID,Address,City,State,Country,Name,Employees
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

### multi indexing

In [9]:
import pandas as pd

company_df = {
    'Company':['Google','Google','Google','Microsoft','Microsoft','Microsoft'],
    'Year' : [2008,2009,2010,2008,2009,2010],
    'Revenue' : [11,15,16,9,12,14],
    'Employee' : [300,400,500,350,450,550]
}
cmp_df = pd.DataFrame(company_df)
cmp_df.set_index(['Company','Year'],inplace=True)    # two level index
cmp_df

                Revenue  Employee
Company   Year
Google    2008       11       300
          2009       15       400
          2010       16       500
Microsoft 2008        9       350
          2009       12       450
          2010       14       550

In [12]:
cmp_df.Revenue.unique()             # to find the distinct values from the column

array([11, 15, 16,  9, 12, 14], dtype=int64)

In [47]:
cmp_df.loc['Google'].loc[2009]            
#cmp_df.shape

Revenue      15
Employee    400
Name: 2009, dtype: int64

In [48]:
#  cmp_df.loc[2009]        # Error Accessing data using second index
                        # pandas allow to access data by using indices sequentially so first index and then 2nd index

In [49]:
## to remove above issue, .xs function allows to access any index as below -
cmp_df.xs('Google',level ='Company')    # level option = name of index at that level

      Revenue  Employee
Year
2008       11       300
2009       15       400
2010       16       500

In [50]:
cmp_df.xs(2009,level='Year')

           Revenue  Employee
Company
Google          15       400
Microsoft       12       450

In [52]:
cmp_df.sort_index(axis=1)      # sort the data as per the labelsalong given axis (row labels or column labels)

                Employee  Revenue
Company   Year
Google    2008       300       11
          2009       400       15
          2010       500       16
Microsoft 2008       350        9
          2009       450       12
          2010       550       14

In [2]:
import seaborn as sns                          # Import seaborn library for dataset
import pandas as pd
tips = sns.load_dataset('tips')
tips.head()                                # head() function returns first 5 rows from dataset

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [3]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
total_bill    244 non-null float64
tip           244 non-null float64
sex           244 non-null category
smoker        244 non-null category
day           244 non-null category
time          244 non-null category
size          244 non-null int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.2 KB

In [8]:
tips.time.unique()                          # to find the distinct values of the column

[Dinner, Lunch]
Categories (2, object): [Dinner, Lunch]

In [19]:
tips.sex.unique()

[Female, Male]
Categories (2, object): [Female, Male]

In [56]:
tips.nunique()          # to get the number of unique values from the dataframe for all the columns

total_bill    229
tip           123
sex             2
smoker          2
day             4
time            2
size            6
dtype: int64

In [61]:
tips['sex'].nunique()          # to get the distinct values of the particular column

2

In [60]:
tips['time'].value_counts()       # to get the count of values in column. Similar to count(column) in SQL

Dinner    176
Lunch      68
Name: time, dtype: int64

In [20]:
tips.shape

(244, 7)

### unique() and shape function

In [22]:
tips['size'].unique()            # use the unique() function on integers as shown

array([2, 3, 4, 1, 6, 5], dtype=int64)

In [25]:
tips.head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [27]:
tips[(tips.time=='Lunch')]['tip'].sum()        # syntax = df[ (df.column == condition) ] [another column].function()
                                                # (df.column == condition): This part returns the boolean value array

185.51000000000002

In [28]:
tips[(tips.time=='Dinner')]['tip'].sum()

546.0699999999999

In [54]:
tips[(tips.time=='Dinner')].shape

(176, 7)

In [55]:
tips[(tips.time=='Lunch')].shape

(68, 7)

In [30]:
l1 = tips[(tips.time=='Lunch')]['tip'].count()        # count the tips on lunch time
d1 = tips[(tips.time=='Dinner')]['tip'].count()       # count the tips on dinner time 
print(l1,'\n',d1)

68
 176

In [32]:
# get the average tip value at different time

lunch_avg= tips[(tips.time=='Lunch')]['tip'].sum() /tips[(tips.time=='Lunch')]['tip'].count()

dinner_avg= tips[(tips.time=='Dinner')]['tip'].sum() /tips[(tips.time=='Dinner')]['tip'].count()
print('lunch_avg :',lunch_avg,'\n','dinner_avg :',dinner_avg)

lunch_avg : 2.728088235294118
 dinner_avg : 3.102670454545454

### group by and aggregate function  - these two go hand in hand

In [41]:
tips.groupby(['time','sex','day'])['tip'].agg(['sum','mean','count','max','min'])    
            
        # Columns mentioned in the group by function are applied in the order they appear. So in above case time is applied
        #   then sex and then day

                       sum      mean  count    max   min
time   sex    day
Lunch  Male   Thur   89.41  2.980333     30   6.70  1.44
              Fri     5.70  1.900000      3   2.20  1.58
       Female Thur   79.42  2.561935     31   5.17  1.25
              Fri    10.98  2.745000      4   3.48  2.00
Dinner Male   Fri    21.23  3.032857      7   4.73  1.50
              Sat   181.95  3.083898     59  10.00  1.00
              Sun   186.78  3.220345     58   6.50  1.32
       Female Thur    3.00  3.000000      1   3.00  3.00
              Fri    14.05  2.810000      5   4.30  1.00
              Sat    78.45  2.801786     28   6.50  1.00
              Sun    60.61  3.367222     18   5.20  1.01

In [45]:
tips.groupby(['time'])['tip'].agg(['sum','mean','count'])

           sum      mean  count
time
Lunch   185.51  2.728088     68
Dinner  546.07  3.102670    176

In [47]:
tips.groupby(['time'])['tip','total_bill'].agg(['sum','mean','count'])

           tip                 total_bill
           sum      mean count        sum       mean count
time
Lunch   185.51  2.728088    68    1167.47  17.168676    68
Dinner  546.07  3.102670   176    3660.30  20.797159   176

### Applying a function on DataFrame

In [62]:
people = [['Rick',60, 'O+'], ['Morty', 10, 'O+'], ['Summer', 45,'A-'], ['Beth',18,'B+']]
people_df = pd.DataFrame(people, columns=['Name','Score', 'Blood Group'])
people_df

     Name  Score Blood Group
0    Rick     60          O+
1   Morty     10          O+
2  Summer     45          A-
3    Beth     18          B+

In [63]:
people_df['Score']*3             # multiply by a number to the elements of the dataframe

0    180
1     30
2    135
3     54
Name: Score, dtype: int64

In [68]:
people_df['Score'].apply(lambda x : x %2==0)

0     True
1     True
2    False
3     True
Name: Score, dtype: bool

In [69]:
people_df['Score'].apply(lambda x: x+10)

0    70
1    20
2    55
3    28
Name: Score, dtype: int64

### sort_values('Column-name')  - used to sort data. 
    Ex :  df.sort_values('Score')

In [73]:
people_df.sort_values('Score')

     Name  Score Blood Group
1   Morty     10          O+
3    Beth     18          B+
2  Summer     45          A-
0    Rick     60          O+

In [72]:
people_df.sort_values('Name',inplace=True)      # sorts the values and modifies the original dataframe
people_df

     Name  Score Blood Group
3    Beth     18          B+
1   Morty     10          O+
0    Rick     60          O+
2  Summer     45          A-

In [74]:
import pandas as pd
air_df = pd.read_csv('https://raw.githubusercontent.com/insaid2018/Term-1/master/Data/Casestudy/AirQualityUCI.csv')   # Import the Dataset

In [76]:
air_df.head()

,Date,Time,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH,AH
0,3/10/2004,18:00:00,2.6,1360,150,11.9,1046,166,1056,113,1692,1268,13.6,48.9,0.7578
1,3/10/2004,19:00:00,2.0,1292,112,9.4,955,103,1174,92,1559,972,13.3,47.7,0.7255
2,3/10/2004,20:00:00,2.2,1402,88,9.0,939,131,1140,114,1555,1074,11.9,54.0,0.7502
3,3/10/2004,21:00:00,2.2,1376,80,9.2,948,172,1092,122,1584,1203,11.0,60.0,0.7867
4,3/10/2004,22:00:00,1.6,1272,51,6.5,836,131,1205,116,1490,1110,11.2,59.6,0.7888

In [77]:
air_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9357 entries, 0 to 9356
Data columns (total 15 columns):
Date             9357 non-null object
Time             9357 non-null object
CO(GT)           9357 non-null float64
PT08.S1(CO)      9357 non-null int64
NMHC(GT)         9357 non-null int64
C6H6(GT)         9357 non-null float64
PT08.S2(NMHC)    9357 non-null int64
NOx(GT)          9357 non-null int64
PT08.S3(NOx)     9357 non-null int64
NO2(GT)          9357 non-null int64
PT08.S4(NO2)     9357 non-null int64
PT08.S5(O3)      9357 non-null int64
T                9357 non-null float64
RH               9357 non-null float64
AH               9357 non-null float64
dtypes: float64(5), int64(8), object(2)
memory usage: 1.1+ MB

In [82]:
type(air_df['CO(GT)'])

pandas.core.series.Series

In [83]:
air_df.describe()

,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH,AH
count,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000
mean,-34.207524,1048.990061,-159.090093,1.865683,894.595276,168.616971,794.990168,58.148873,1391.479641,975.072032,9.778305,39.485380,-6.837604
std,77.657170,329.832710,139.789093,41.380206,342.333252,257.433866,321.993552,126.940455,467.210125,456.938184,43.203623,51.216145,38.976670
min,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000
25%,0.600000,921.000000,-200.000000,4.000000,711.000000,50.000000,637.000000,53.000000,1185.000000,700.000000,10.900000,34.100000,0.692300
50%,1.500000,1053.000000,-200.000000,7.900000,895.000000,141.000000,794.000000,96.000000,1446.000000,942.000000,17.200000,48.600000,0.976800
75%,2.600000,1221.000000,-200.000000,13.600000,1105.000000,284.000000,960.000000,133.000000,1662.000000,1255.000000,24.100000,61.900000,1.296200
max,11.900000,2040.000000,1189.000000,63.700000,2214.000000,1479.000000,2683.000000,340.000000,2775.000000,2523.000000,44.600000,88.700000,2.231000

In [85]:
air_df[air_df['NMHC(GT)']== -200]['NMHC(GT)'].count()  
                                        # almost 90% of the values from this column are -200 so dropping this column

8443

In [87]:
air_df.drop(['NMHC(GT)'],axis=1)        # drop the column NMHC(GT)
air_df.head()

,Date,Time,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH,AH
0,3/10/2004,18:00:00,2.6,1360,150,11.9,1046,166,1056,113,1692,1268,13.6,48.9,0.7578
1,3/10/2004,19:00:00,2.0,1292,112,9.4,955,103,1174,92,1559,972,13.3,47.7,0.7255
2,3/10/2004,20:00:00,2.2,1402,88,9.0,939,131,1140,114,1555,1074,11.9,54.0,0.7502
3,3/10/2004,21:00:00,2.2,1376,80,9.2,948,172,1092,122,1584,1203,11.0,60.0,0.7867
4,3/10/2004,22:00:00,1.6,1272,51,6.5,836,131,1205,116,1490,1110,11.2,59.6,0.7888

In [90]:
air_df.head(2)

,Date,Time,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH,AH
0,3/10/2004,18:00:00,2.6,1360,150,11.9,1046,166,1056,113,1692,1268,13.6,48.9,0.7578
1,3/10/2004,19:00:00,2.0,1292,112,9.4,955,103,1174,92,1559,972,13.3,47.7,0.7255

In [97]:
air_df['Date'] = pd.to_datetime(air_df['Date'],format='%d/%m/%y')
air_df.info()                                         # datatpe of the Date column has changed as shown below

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9357 entries, 0 to 9356
Data columns (total 15 columns):
Date             9357 non-null datetime64[ns]
Time             9357 non-null object
CO(GT)           9357 non-null float64
PT08.S1(CO)      9357 non-null int64
NMHC(GT)         9357 non-null int64
C6H6(GT)         9357 non-null float64
PT08.S2(NMHC)    9357 non-null int64
NOx(GT)          9357 non-null int64
PT08.S3(NOx)     9357 non-null int64
NO2(GT)          9357 non-null int64
PT08.S4(NO2)     9357 non-null int64
PT08.S5(O3)      9357 non-null int64
T                9357 non-null float64
RH               9357 non-null float64
AH               9357 non-null float64
dtypes: datetime64[ns](1), float64(5), int64(8), object(1)
memory usage: 1.1+ MB

In [98]:
air_df['Time'].unique()            # display all the distinct values from the column

array(['18:00:00', '19:00:00', '20:00:00', '21:00:00', '22:00:00',
       '23:00:00', '0:00:00', '1:00:00', '2:00:00', '3:00:00', '4:00:00',
       '5:00:00', '6:00:00', '7:00:00', '8:00:00', '9:00:00', '10:00:00',
       '11:00:00', '12:00:00', '13:00:00', '14:00:00', '15:00:00',
       '16:00:00', '17:00:00'], dtype=object)

In [99]:
air_df['Time'].nunique()           # number of unique values.

24

In [100]:
air_df['Time'] = pd.to_datetime(air_df['Time'], format='%H:%M:%S')

In [101]:
air_df.dtypes

Date             datetime64[ns]
Time             datetime64[ns]
CO(GT)                  float64
PT08.S1(CO)               int64
NMHC(GT)                  int64
C6H6(GT)                float64
PT08.S2(NMHC)             int64
NOx(GT)                   int64
PT08.S3(NOx)              int64
NO2(GT)                   int64
PT08.S4(NO2)              int64
PT08.S5(O3)               int64
T                       float64
RH                      float64
AH                      float64
dtype: object

In [103]:
month1 = air_df.Date.dt.month
month1.head()

0    3
1    3
2    3
3    3
4    3
Name: Date, dtype: int64

In [105]:
year =air_df.Date.dt.year       
year.head()

0    2004
1    2004
2    2004
3    2004
4    2004
Name: Date, dtype: int64

In [108]:
hr =air_df.Date.dt.hour
hr.head()

0    0
1    0
2    0
3    0
4    0
Name: Date, dtype: int64